artillery/bloqueante.txt
{
  "aggregate": {
    "counters": {
      "vusers.created_by_name.0": 50,
      "vusers.created": 50,
      "http.requests": 1000,
      "http.codes.200": 1000,
      "http.responses": 1000,
      "vusers.failed": 0,
      "vusers.completed": 50
    },
    "rates": {
      "http.request_rate": 31
    },
    "firstCounterAt": 1675984633412,
    "firstHistogramAt": 1675984633813,
    "lastCounterAt": 1675984661851,
    "lastHistogramAt": 1675984661851,
    "firstMetricAt": 1675984633412,
    "lastMetricAt": 1675984661851,
    "period": 1675984660000,
    "summaries": {
      "http.response_time": {
        "min": 31,
        "max": 3869,
        "count": 1000,
        "p50": 584.2,
        "median": 584.2,
        "p75": 727.9,
        "p90": 889.1,
        "p95": 1353.1,
        "p99": 2369,
        "p999": 2780
      },
      "vusers.session_length": {
        "min": 25435.3,
        "max": 27960.8,
        "count": 50,
        "p50": 26115.6,
        "median": 26115.6,
        "p75": 26643.2,
        "p90": 26643.2,
        "p95": 27181.5,
        "p99": 27730.6,
        "p999": 27730.6
      }
    },
    "histograms": {
      "http.response_time": {
        "min": 31,
        "max": 3869,
        "count": 1000,
        "p50": 584.2,
        "median": 584.2,
        "p75": 727.9,
        "p90": 889.1,
        "p95": 1353.1,
        "p99": 2369,
        "p999": 2780
      },
      "vusers.session_length": {
        "min": 25435.3,
        "max": 27960.8,
        "count": 50,
        "p50": 26115.6,
        "median": 26115.6,
        "p75": 26643.2,
        "p90": 26643.2,
        "p95": 27181.5,
        "p99": 27730.6,
        "p999": 27730.6
      }
    }
  },
  "intermediate": [
    {
      "counters": {
        "vusers.created_by_name.0": 50,
        "vusers.created": 50,
        "http.requests": 142,
        "http.codes.200": 103,
        "http.responses": 103
      },
      "rates": {
        "http.request_rate": 22
      },
      "http.request_rate": null,
      "firstCounterAt": 1675984633412,
      "firstHistogramAt": 1675984633813,
      "lastCounterAt": 1675984639983,
      "lastHistogramAt": 1675984639878,
      "firstMetricAt": 1675984633412,
      "lastMetricAt": 1675984639983,
      "period": "1675984630000",
      "summaries": {
        "http.response_time": {
          "min": 31,
          "max": 3869,
          "count": 103,
          "p50": 1064.4,
          "median": 1064.4,
          "p75": 1556.5,
          "p90": 2059.5,
          "p95": 2369,
          "p99": 2780,
          "p999": 2780
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 31,
          "max": 3869,
          "count": 103,
          "p50": 1064.4,
          "median": 1064.4,
          "p75": 1556.5,
          "p90": 2059.5,
          "p95": 2369,
          "p99": 2780,
          "p999": 2780
        }
      }
    },
    {
      "counters": {
        "http.codes.200": 375,
        "http.responses": 375,
        "http.requests": 365
      },
      "rates": {
        "http.request_rate": 37
      },
      "http.request_rate": null,
      "firstCounterAt": 1675984640002,
      "firstHistogramAt": 1675984640002,
      "lastCounterAt": 1675984649999,
      "lastHistogramAt": 1675984649943,
      "firstMetricAt": 1675984640002,
      "lastMetricAt": 1675984649999,
      "period": "1675984640000",
      "summaries": {
        "http.response_time": {
          "min": 400,
          "max": 2735,
          "count": 375,
          "p50": 685.5,
          "median": 685.5,
          "p75": 820.7,
          "p90": 907,
          "p95": 963.1,
          "p99": 2059.5,
          "p999": 2322.1
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 400,
          "max": 2735,
          "count": 375,
          "p50": 685.5,
          "median": 685.5,
          "p75": 820.7,
          "p90": 907,
          "p95": 963.1,
          "p99": 2059.5,
          "p999": 2322.1
        }
      }
    },
    {
      "counters": {
        "http.requests": 468,
        "http.codes.200": 483,
        "http.responses": 483,
        "vusers.failed": 0,
        "vusers.completed": 21
      },
      "rates": {
        "http.request_rate": 47
      },
      "http.request_rate": null,
      "firstCounterAt": 1675984650000,
      "firstHistogramAt": 1675984650001,
      "lastCounterAt": 1675984659992,
      "lastHistogramAt": 1675984659992,
      "firstMetricAt": 1675984650000,
      "lastMetricAt": 1675984659992,
      "period": "1675984650000",
      "summaries": {
        "http.response_time": {
          "min": 330,
          "max": 2481,
          "count": 483,
          "p50": 539.2,
          "median": 539.2,
          "p75": 632.8,
          "p90": 699.4,
          "p95": 757.6,
          "p99": 907,
          "p999": 2369
        },
        "vusers.session_length": {
          "min": 25435.3,
          "max": 26348.6,
          "count": 21,
          "p50": 25598.5,
          "median": 25598.5,
          "p75": 26115.6,
          "p90": 26115.6,
          "p95": 26115.6,
          "p99": 26115.6,
          "p999": 26115.6
        }
      },
      "histograms": {
        "http.response_time": {
          "min": 330,
          "max": 2481,
          "count": 483,
          "p50": 539.2,
          "median": 539.2,
          "p75": 632.8,
          "p90": 699.4,
          "p95": 757.6,
          "p99": 907,
          "p999": 2369
        },
        "vusers.session_length": {
          "min": 25435.3,
          "max": 26348.6,
          "count": 21,
          "p50": 25598.5,
          "median": 25598.5,
          "p75": 26115.6,
          "p90": 26115.6,
          "p95": 26115.6,
          "p99": 26115.6,
          "p999": 26115.6
        }
      }
    },
    {
      "counters": {
        "vusers.failed": 0,
        "vusers.completed": 29,
        "http.requests": 25,
        "http.codes.200": 39,
        "http.responses": 39
      },
      "rates": {
        "http.request_rate": 17
      },
      "http.request_rate": null,
      "firstCounterAt": 1675984660000,
      "firstHistogramAt": 1675984660000,
      "lastCounterAt": 1675984661851,
      "lastHistogramAt": 1675984661851,
      "firstMetricAt": 1675984660000,
      "lastMetricAt": 1675984661851,
      "period": "1675984660000",
      "summaries": {
        "vusers.session_length": {
          "min": 25473.1,
          "max": 27960.8,
          "count": 29,
          "p50": 26643.2,
          "median": 26643.2,
          "p75": 26643.2,
          "p90": 27181.5,
          "p95": 27730.6,
          "p99": 27730.6,
          "p999": 27730.6
        },
        "http.response_time": {
          "min": 197,
          "max": 368,
          "count": 39,
          "p50": 228.2,
          "median": 228.2,
          "p75": 262.5,
          "p90": 278.7,
          "p95": 347.3,
          "p99": 347.3,
          "p999": 347.3
        }
      },
      "histograms": {
        "vusers.session_length": {
          "min": 25473.1,
          "max": 27960.8,
          "count": 29,
          "p50": 26643.2,
          "median": 26643.2,
          "p75": 26643.2,
          "p90": 27181.5,
          "p95": 27730.6,
          "p99": 27730.6,
          "p999": 27730.6
        },
        "http.response_time": {
          "min": 197,
          "max": 368,
          "count": 39,
          "p50": 228.2,
          "median": 228.2,
          "p75": 262.5,
          "p90": 278.7,
          "p95": 347.3,
          "p99": 347.3,
          "p999": 347.3
        }
      }
    }
  ]
}